var obj = { 'Коля': '1000', 'Вася': '500', 'Петя': '200' };
console.log('Зарплата Коли--> ', obj['Коля']);
console.log('Зарплата Пети--> ', obj['Петя']);

console.log('///////////////////////////////////////////////////////////////|-< Задание № 2 >-|//////////////////////////////////////////////////////////////');


var arr = {
  'ru': ['голубой', 'красный', 'зеленый'],
  'en': ['blue', 'red', 'green'],
};
console.log('Дан массив -->', arr);
console.log('Первый элемент массива ru -->', arr['ru'][0]);

console.log('///////////////////////////////////////////////////////////////|-< Задание № 3 >-|//////////////////////////////////////////////////////////////');



var arr = {
  'ru': ['голубой', 'красный', 'зеленый'],
  get allColors() {
    return `${arr['ru']} ` ;
  },
  set newColors(color) {
    arr['ru'].push(color);
  },
};
console.log('Все цвета -->', arr.allColors); 
arr.newColors = 'синий';
console.log('Все цвета -->', arr.allColors); 